zevorn/qemu/hw/mcs51/stc32g_dsp.c
/*
 * STC32G DSP32 command accelerator
 *
 * Copyright (c) 2026 Process Mission
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "qemu/host-utils.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/register.h"
#include "hw/core/registerfields.h"
#include "hw/core/sysbus.h"
#include "hw/mcs51/stc32g_dsp.h"
#include "migration/vmstate.h"
#include "target/mcs51/cpu.h"

REG8(DPUST, 0)
    FIELD(DPUST, SC, 0, 6)
    FIELD(DPUST, DBZ, 6, 1)
    FIELD(DPUST, Z, 7, 1)
REG8(DPUOP, 0)
FIELD(DPUCFG, CDRS, 0, 3)

enum Stc32gDSPCommand {
    DSP_FILL_DPUCFG = 0x80,
    DSP_BIN2BCD = 0x81,
    DSP_BCD2BIN = 0x82,
    DSP_NRM_BX = 0x83,
    DSP_NRM_EBX = 0x84,
    DSP_NRM_EABX = 0x85,
    DSP_SWAP_EAB = 0x86,
    DSP_SWAP_ECD = 0x87,
    DSP_SWAP_EAC = 0x88,
    DSP_SWAP_EBD = 0x89,
    DSP_ADDC_EABX = 0x90,
    DSP_ADDC_ABX = 0x91,
    DSP_ADD_EABX = 0x92,
    DSP_ADD_ABX = 0x93,
    DSP_SUBB_EABX = 0x94,
    DSP_SUBB_ABX = 0x95,
    DSP_SUB_EABX = 0x96,
    DSP_SUB_ABX = 0x97,
    DSP_CMP_EABX = 0x98,
    DSP_CMP_ABX = 0x99,
    DSP_MULU_EABX = 0x9a,
    DSP_MULS_EABX = 0x9b,
    DSP_MULU_ABX = 0x9c,
    DSP_MULS_ABX = 0x9d,
    DSP_MULX_KEIL16 = 0x9e,
    DSP_DIVU_EABX = 0x9f,
    DSP_DIVS_EABX = 0xa0,
    DSP_DIVU_ABX = 0xa1,
    DSP_DIVU_KEIL16 = 0xa2,
    DSP_DIVS_ABX = 0xa3,
    DSP_DIVS_KEIL16 = 0xa4,
    DSP_DIVU_EABXD = 0xa5,
    DSP_DIVU_EAXB = 0xa6,
    DSP_SET0_EAX = 0xb0,
    DSP_SET1_EAX = 0xb1,
    DSP_SET0_EBX = 0xb2,
    DSP_SET1_EBX = 0xb3,
    DSP_SET0_ECX = 0xb4,
    DSP_SET1_ECX = 0xb5,
    DSP_SET0_EDX = 0xb6,
    DSP_SET1_EDX = 0xb7,
    DSP_NEGS_EAX = 0xb8,
    DSP_NEGS_EBX = 0xb9,
    DSP_NEGS_AX = 0xba,
    DSP_NEGS_BX = 0xbb,
    DSP_INC1_EAX = 0xc0,
    DSP_INC1_EBX = 0xc1,
    DSP_INC4_EAX = 0xc2,
    DSP_INC4_EBX = 0xc3,
    DSP_INC1_AX = 0xc4,
    DSP_INC1_BX = 0xc5,
    DSP_INC2_AX = 0xc6,
    DSP_INC2_BX = 0xc7,
    DSP_DEC1_EAX = 0xc8,
    DSP_DEC1_EBX = 0xc9,
    DSP_DEC4_EAX = 0xca,
    DSP_DEC4_EBX = 0xcb,
    DSP_DEC1_AX = 0xcc,
    DSP_DEC1_BX = 0xcd,
    DSP_DEC2_AX = 0xce,
    DSP_DEC2_BX = 0xcf,
    DSP_BAND_EABX = 0xd0,
    DSP_BAND_ABX = 0xd1,
    DSP_BOR_EABX = 0xd2,
    DSP_BOR_ABX = 0xd3,
    DSP_BXOR_EABX = 0xd4,
    DSP_BXOR_ABX = 0xd5,
    DSP_BCPL_EAX = 0xd6,
    DSP_BCPL_EBX = 0xd7,
    DSP_SHL_EAX = 0xe0,
    DSP_SHL_EBX = 0xe1,
    DSP_SHL_AX = 0xe2,
    DSP_SHL_BX = 0xe3,
    DSP_SHRU_EAX = 0xe4,
    DSP_SHRU_EBX = 0xe5,
    DSP_SHRU_AX = 0xe6,
    DSP_SHRU_BX = 0xe7,
    DSP_SHRS_EAX = 0xe8,
    DSP_SHRS_EBX = 0xe9,
    DSP_SHRS_AX = 0xea,
    DSP_SHRS_BX = 0xeb,
    DSP_ROR_EAX = 0xec,
    DSP_ROR_EBX = 0xed,
    DSP_ROR_AX = 0xee,
    DSP_ROR_BX = 0xef,
    DSP_MMD32_EABX = 0xf0,
    DSP_MMD16_ABX = 0xf1,
    DSP_LTC32_EAX = 0xf2,
    DSP_LTC16_AX = 0xf3,
    DSP_MA32_EDX = 0xf4,
    DSP_MA64_ECDX = 0xf5,
};

struct Stc32gDSPState {
    SysBusDevice parent_obj;

    MCS251CPU *cpu;
    RegisterInfoArray *status_reg_array;
    RegisterInfoArray *command_reg_array;
    RegisterInfo status_reg_info[1];
    RegisterInfo command_reg_info[1];
    uint8_t status_regs[1];
    uint8_t command_regs[1];
    uint8_t dpucfg;
};

static uint32_t stc32g_dsp_get_data32(Stc32gDSPState *s, unsigned base)
{
    CPUMCS251State *env = &s->cpu->env;
    uint32_t value = 0;
    unsigned i;

    for (i = 0; i < 4; i++) {
        value = deposit32(value, (3 - i) * 8, 8,
                          mcs251_cpu_direct_read(env, base + i));
    }
    return value;
}

static void stc32g_dsp_set_data32(Stc32gDSPState *s, unsigned base,
                                  uint32_t value)
{
    CPUMCS251State *env = &s->cpu->env;
    unsigned i;

    for (i = 0; i < 4; i++) {
        mcs251_cpu_direct_write(env, base + i,
                               extract32(value, (3 - i) * 8, 8));
    }
}

static uint32_t stc32g_dsp_get_eax(Stc32gDSPState *s)
{
    return mcs251_cpu_get_reg(&s->cpu->env, 4, 4);
}

static void stc32g_dsp_set_eax(Stc32gDSPState *s, uint32_t value)
{
    mcs251_cpu_set_reg(&s->cpu->env, 4, 4, value);
}

static uint32_t stc32g_dsp_get_ebx(Stc32gDSPState *s)
{
    return mcs251_cpu_get_reg(&s->cpu->env, 0, 4);
}

static void stc32g_dsp_set_ebx(Stc32gDSPState *s, uint32_t value)
{
    mcs251_cpu_set_reg(&s->cpu->env, 0, 4, value);
}

static uint16_t stc32g_dsp_get_ax(Stc32gDSPState *s)
{
    return stc32g_dsp_get_eax(s);
}

static void stc32g_dsp_set_ax(Stc32gDSPState *s, uint16_t value)
{
    stc32g_dsp_set_eax(s, deposit32(stc32g_dsp_get_eax(s),
                                    0, 16, value));
}

static uint16_t stc32g_dsp_get_ax2(Stc32gDSPState *s)
{
    return extract32(stc32g_dsp_get_eax(s), 16, 16);
}

static void stc32g_dsp_set_ax2(Stc32gDSPState *s, uint16_t value)
{
    stc32g_dsp_set_eax(s, deposit32(stc32g_dsp_get_eax(s),
                                    16, 16, value));
}

static void stc32g_dsp_set_bx(Stc32gDSPState *s, uint16_t value)
{
    stc32g_dsp_set_ebx(s, deposit32(stc32g_dsp_get_ebx(s),
                                    0, 16, value));
}

static bool stc32g_dsp_get_cd(Stc32gDSPState *s, bool ecx,
                              uint32_t *value)
{
    unsigned cdrs = FIELD_EX8(s->dpucfg, DPUCFG, CDRS);
    unsigned base;

    if (cdrs < 4) {
        base = cdrs * 8 + (ecx ? 4 : 0);
        *value = stc32g_dsp_get_data32(s, base);
        return true;
    }
    if (cdrs == 5 || cdrs == 6) {
        base = cdrs == 5 ? 16 : 24;
        *value = mcs251_cpu_get_reg(&s->cpu->env,
                                    base + (ecx ? 4 : 0), 4);
        return true;
    }
    return false;
}

static bool stc32g_dsp_set_cd(Stc32gDSPState *s, bool ecx,
                              uint32_t value)
{
    unsigned cdrs = FIELD_EX8(s->dpucfg, DPUCFG, CDRS);
    unsigned base;

    if (cdrs < 4) {
        base = cdrs * 8 + (ecx ? 4 : 0);
        stc32g_dsp_set_data32(s, base, value);
        return true;
    }
    if (cdrs == 5 || cdrs == 6) {
        base = cdrs == 5 ? 16 : 24;
        mcs251_cpu_set_reg(&s->cpu->env, base + (ecx ? 4 : 0),
                           4, value);
        return true;
    }
    return false;
}

