zevorn/qemu/hw/mcs51/stc32g_dsp.c
static void stc32g_dsp_set_z(Stc32gDSPState *s, uint64_t value)
{
    s->status_regs[R_DPUST] =
        FIELD_DP8(s->status_regs[R_DPUST], DPUST, Z, value == 0);
}

static void stc32g_dsp_set_dbz(Stc32gDSPState *s, bool value)
{
    s->status_regs[R_DPUST] =
        FIELD_DP8(s->status_regs[R_DPUST], DPUST, DBZ, value);
}

static void stc32g_dsp_set_sc(Stc32gDSPState *s, unsigned value)
{
    s->status_regs[R_DPUST] =
        FIELD_DP8(s->status_regs[R_DPUST], DPUST, SC, value);
}

static uint32_t stc32g_dsp_add(Stc32gDSPState *s, uint32_t lhs,
                               uint32_t rhs, unsigned carry,
                               unsigned width, bool update_z)
{
    CPUMCS251State *env = &s->cpu->env;
    uint64_t mask = MAKE_64BIT_MASK(0, width);
    uint64_t wide = (lhs & mask) + (rhs & mask) + carry;
    uint32_t result = wide & mask;
    uint32_t sign = BIT(width - 1);

    env->flag_c = wide > mask;
    env->flag_ov = (~(lhs ^ rhs) & (lhs ^ result) & sign) != 0;
    if (update_z) {
        stc32g_dsp_set_z(s, result);
    }
    return result;
}

static uint32_t stc32g_dsp_sub(Stc32gDSPState *s, uint32_t lhs,
                               uint32_t rhs, unsigned borrow,
                               unsigned width, bool update_z)
{
    CPUMCS251State *env = &s->cpu->env;
    uint64_t mask = MAKE_64BIT_MASK(0, width);
    uint64_t effective_rhs = (rhs & mask) + borrow;
    uint32_t result = (lhs - effective_rhs) & mask;
    uint32_t sign = BIT(width - 1);
    uint32_t masked_rhs = effective_rhs & mask;

    env->flag_c = (lhs & mask) < effective_rhs;
    env->flag_ov =
        ((lhs ^ masked_rhs) & (lhs ^ result) & sign) != 0;
    if (update_z) {
        stc32g_dsp_set_z(s, result);
    }
    return result;
}

static uint32_t stc32g_dsp_accumulate(Stc32gDSPState *s, uint32_t value,
                                      int delta, unsigned width)
{
    CPUMCS251State *env = &s->cpu->env;
    uint64_t mask = MAKE_64BIT_MASK(0, width);
    uint32_t result;

    if (delta >= 0) {
        uint64_t wide = (value & mask) + delta;

        result = wide & mask;
        env->flag_c = wide > mask;
    } else {
        uint64_t magnitude = -delta;

        result = (value - magnitude) & mask;
        env->flag_c = (value & mask) < magnitude;
    }
    stc32g_dsp_set_z(s, result);
    return result;
}

static bool stc32g_dsp_divisor_ok(Stc32gDSPState *s, uint64_t divisor)
{
    stc32g_dsp_set_dbz(s, divisor == 0);
    return divisor != 0;
}

static uint32_t stc32g_dsp_shift_left(Stc32gDSPState *s, uint32_t value,
                                      unsigned count, unsigned width)
{
    uint64_t mask = MAKE_64BIT_MASK(0, width);

    if (count) {
        s->cpu->env.flag_c = (value >> (width - count)) & 1;
    }
    return (value << count) & mask;
}

static uint32_t stc32g_dsp_shift_right(Stc32gDSPState *s, uint32_t value,
                                       unsigned count, unsigned width,
                                       bool arithmetic)
{
    if (count) {
        s->cpu->env.flag_c = (value >> (count - 1)) & 1;
    }
    if (!arithmetic) {
        return value >> count;
    }
    if (width == 16) {
        return (uint16_t)((int16_t)value >> count);
    }
    return (uint32_t)((int32_t)value >> count);
}

static void stc32g_dsp_execute(Stc32gDSPState *s, uint8_t command)
{
    CPUMCS251State *env = &s->cpu->env;
    uint32_t eax = stc32g_dsp_get_eax(s);
    uint32_t ebx = stc32g_dsp_get_ebx(s);
    uint32_t ecx;
    uint32_t edx;
    uint32_t result;
    uint64_t wide;
    unsigned count;

    switch (command) {
    case DSP_FILL_DPUCFG:
        s->dpucfg = mcs251_cpu_get_reg8(env, MCS251_REG_ACC);
        break;
    case DSP_BIN2BCD:
        wide = 0;
        for (count = 0; count < 10; count++) {
            wide |= (uint64_t)(ebx % 10) << (count * 4);
            ebx /= 10;
        }
        stc32g_dsp_set_eax(s, wide >> 32);
        stc32g_dsp_set_ebx(s, wide);
        break;
    case DSP_BCD2BIN:
        wide = ((uint64_t)(eax & 0x7f) << 32) | ebx;
        result = 0;
        for (count = 0; count < 10; count++) {
            result = result * 10 + extract64(wide, (9 - count) * 4, 4);
        }
        stc32g_dsp_set_eax(s, result);
        break;
    case DSP_NRM_BX:
        count = clrsb32((int32_t)(int16_t)ebx) - 16;
        stc32g_dsp_set_bx(s, (uint16_t)ebx << count);
        stc32g_dsp_set_sc(s, count);
        break;
    case DSP_NRM_EBX:
        count = clrsb32(ebx);
        stc32g_dsp_set_ebx(s, ebx << count);
        stc32g_dsp_set_sc(s, count);
        break;
    case DSP_NRM_EABX:
        wide = ((uint64_t)eax << 32) | ebx;
        count = clrsb64(wide);
        wide <<= count;
        stc32g_dsp_set_eax(s, wide >> 32);
        stc32g_dsp_set_ebx(s, wide);
        stc32g_dsp_set_sc(s, count);
        break;
    case DSP_SWAP_EAB:
        stc32g_dsp_set_eax(s, ebx);
        stc32g_dsp_set_ebx(s, eax);
        break;
    case DSP_SWAP_ECD:
        if (stc32g_dsp_get_cd(s, true, &ecx) &&
            stc32g_dsp_get_cd(s, false, &edx)) {
            stc32g_dsp_set_cd(s, true, edx);
            stc32g_dsp_set_cd(s, false, ecx);
        }
        break;
    case DSP_SWAP_EAC:
        if (stc32g_dsp_get_cd(s, true, &ecx)) {
            stc32g_dsp_set_eax(s, ecx);
            stc32g_dsp_set_cd(s, true, eax);
        }
        break;
    case DSP_SWAP_EBD:
        if (stc32g_dsp_get_cd(s, false, &edx)) {
            stc32g_dsp_set_ebx(s, edx);
            stc32g_dsp_set_cd(s, false, ebx);
        }
        break;
    case DSP_ADDC_EABX:
        stc32g_dsp_set_eax(
            s, stc32g_dsp_add(s, eax, ebx, env->flag_c, 32, true));
        break;
    case DSP_ADDC_ABX:
        stc32g_dsp_set_ax(
            s, stc32g_dsp_add(s, eax, ebx, env->flag_c, 16, true));
        break;
    case DSP_ADD_EABX:
        stc32g_dsp_set_eax(
            s, stc32g_dsp_add(s, eax, ebx, 0, 32, true));
        break;
    case DSP_ADD_ABX:
        stc32g_dsp_set_ax(
            s, stc32g_dsp_add(s, eax, ebx, 0, 16, true));
        break;
    case DSP_SUBB_EABX:
        stc32g_dsp_set_eax(
            s, stc32g_dsp_sub(s, eax, ebx, env->flag_c, 32, true));
        break;
    case DSP_SUBB_ABX:
        stc32g_dsp_set_ax(
            s, stc32g_dsp_sub(s, eax, ebx, env->flag_c, 16, true));
        break;
    case DSP_SUB_EABX:
        stc32g_dsp_set_eax(
            s, stc32g_dsp_sub(s, eax, ebx, 0, 32, true));
        break;
    case DSP_SUB_ABX:
        stc32g_dsp_set_ax(
            s, stc32g_dsp_sub(s, eax, ebx, 0, 16, true));
        break;
    case DSP_CMP_EABX:
        stc32g_dsp_sub(s, eax, ebx, 0, 32, true);
        break;
    case DSP_CMP_ABX:
        stc32g_dsp_sub(s, eax, ebx, 0, 16, true);
        break;
    case DSP_MULU_EABX:
        if (stc32g_dsp_get_cd(s, false, &edx)) {
            wide = (uint64_t)eax * ebx;
            stc32g_dsp_set_eax(s, wide);
            stc32g_dsp_set_cd(s, false, wide >> 32);
        }
        break;
    case DSP_MULS_EABX:
        if (stc32g_dsp_get_cd(s, false, &edx)) {
            wide = (int64_t)(int32_t)eax * (int32_t)ebx;
            stc32g_dsp_set_eax(s, wide);
            stc32g_dsp_set_cd(s, false, wide >> 32);
        }
        break;
    case DSP_MULU_ABX:
        stc32g_dsp_set_eax(s, (uint32_t)(uint16_t)eax *
                              (uint16_t)ebx);
        break;
    case DSP_MULS_ABX:
        stc32g_dsp_set_eax(s, (int32_t)(int16_t)eax *
                              (int16_t)ebx);
        break;
    case DSP_MULX_KEIL16:
        stc32g_dsp_set_ax(s, stc32g_dsp_get_ax2(s) *
                             stc32g_dsp_get_ax(s));
        break;
    case DSP_DIVU_EABX:
        if (stc32g_dsp_divisor_ok(s, ebx)) {
            stc32g_dsp_set_eax(s, eax / ebx);
            stc32g_dsp_set_ebx(s, eax % ebx);
        }
        break;
    case DSP_DIVS_EABX:
        if (stc32g_dsp_divisor_ok(s, ebx)) {
            int32_t dividend = eax;
            int32_t divisor = ebx;

            if (dividend == INT32_MIN && divisor == -1) {
                stc32g_dsp_set_eax(s, INT32_MIN);
                stc32g_dsp_set_ebx(s, 0);
            } else {
                stc32g_dsp_set_eax(s, dividend / divisor);
                stc32g_dsp_set_ebx(s, dividend % divisor);
            }
        }
        break;
    case DSP_DIVU_ABX:
        if (stc32g_dsp_divisor_ok(s, (uint16_t)ebx)) {
            uint16_t dividend = eax;
            uint16_t divisor = ebx;

            stc32g_dsp_set_ax(s, dividend / divisor);
            stc32g_dsp_set_bx(s, dividend % divisor);
        }
        break;
    case DSP_DIVU_KEIL16:
        if (stc32g_dsp_divisor_ok(s, stc32g_dsp_get_ax2(s))) {
            uint16_t dividend = stc32g_dsp_get_ax(s);
            uint16_t divisor = stc32g_dsp_get_ax2(s);

            stc32g_dsp_set_ax(s, dividend / divisor);
            stc32g_dsp_set_ax2(s, dividend % divisor);
        }
        break;
    case DSP_DIVS_ABX:
        if (stc32g_dsp_divisor_ok(s, (uint16_t)ebx)) {
            int32_t dividend = (int16_t)eax;
            int32_t divisor = (int16_t)ebx;

            stc32g_dsp_set_ax(s, dividend / divisor);
            stc32g_dsp_set_bx(s, dividend % divisor);
        }
        break;
    case DSP_DIVS_KEIL16:
        if (stc32g_dsp_divisor_ok(s, stc32g_dsp_get_ax2(s))) {
            int32_t dividend = (int16_t)stc32g_dsp_get_ax(s);
            int32_t divisor = (int16_t)stc32g_dsp_get_ax2(s);

            stc32g_dsp_set_ax(s, dividend / divisor);
            stc32g_dsp_set_ax2(s, dividend % divisor);
        }
        break;
    case DSP_DIVU_EABXD:
        if (stc32g_dsp_get_cd(s, false, &edx) &&
            stc32g_dsp_divisor_ok(s, edx)) {
            wide = ((uint64_t)eax << 32) | ebx;
            stc32g_dsp_set_eax(s, (wide / edx) >> 32);
            stc32g_dsp_set_ebx(s, wide / edx);
            stc32g_dsp_set_cd(s, false, wide % edx);
        }
        break;
    case DSP_DIVU_EAXB:
        if (stc32g_dsp_divisor_ok(s, (uint16_t)ebx)) {
            uint16_t divisor = ebx;

