zevorn/qemu/hw/mcs51/stc32g_dsp.c
            stc32g_dsp_set_eax(s, eax / divisor);
            stc32g_dsp_set_bx(s, eax % divisor);
        }
        break;
    case DSP_SET0_EAX:
    case DSP_SET1_EAX:
        stc32g_dsp_set_eax(s, command & 1 ? UINT32_MAX : 0);
        break;
    case DSP_SET0_EBX:
    case DSP_SET1_EBX:
        stc32g_dsp_set_ebx(s, command & 1 ? UINT32_MAX : 0);
        break;
    case DSP_SET0_ECX:
    case DSP_SET1_ECX:
        stc32g_dsp_set_cd(s, true, command & 1 ? UINT32_MAX : 0);
        break;
    case DSP_SET0_EDX:
    case DSP_SET1_EDX:
        stc32g_dsp_set_cd(s, false, command & 1 ? UINT32_MAX : 0);
        break;
    case DSP_NEGS_EAX:
        stc32g_dsp_set_eax(s, -eax);
        break;
    case DSP_NEGS_EBX:
        stc32g_dsp_set_ebx(s, -ebx);
        break;
    case DSP_NEGS_AX:
        stc32g_dsp_set_ax(s, -(uint16_t)eax);
        break;
    case DSP_NEGS_BX:
        stc32g_dsp_set_bx(s, -(uint16_t)ebx);
        break;
    case DSP_INC1_EAX:
    case DSP_INC4_EAX:
    case DSP_DEC1_EAX:
    case DSP_DEC4_EAX: {
        static const int delta[] = { 1, 4, -1, -4 };
        unsigned index = ((command & 8) >> 2) | ((command & 2) >> 1);

        stc32g_dsp_set_eax(
            s, stc32g_dsp_accumulate(s, eax, delta[index], 32));
        break;
    }
    case DSP_INC1_EBX:
    case DSP_INC4_EBX:
    case DSP_DEC1_EBX:
    case DSP_DEC4_EBX: {
        static const int delta[] = { 1, 4, -1, -4 };
        unsigned index = ((command & 8) >> 2) | ((command & 2) >> 1);

        stc32g_dsp_set_ebx(
            s, stc32g_dsp_accumulate(s, ebx, delta[index], 32));
        break;
    }
    case DSP_INC1_AX:
    case DSP_INC2_AX:
    case DSP_DEC1_AX:
    case DSP_DEC2_AX: {
        static const int delta[] = { 1, 2, -1, -2 };
        unsigned index = ((command & 8) >> 2) | ((command & 2) >> 1);

        stc32g_dsp_set_ax(
            s, stc32g_dsp_accumulate(s, eax, delta[index], 16));
        break;
    }
    case DSP_INC1_BX:
    case DSP_INC2_BX:
    case DSP_DEC1_BX:
    case DSP_DEC2_BX: {
        static const int delta[] = { 1, 2, -1, -2 };
        unsigned index = ((command & 8) >> 2) | ((command & 2) >> 1);

        stc32g_dsp_set_bx(
            s, stc32g_dsp_accumulate(s, ebx, delta[index], 16));
        break;
    }
    case DSP_BAND_EABX:
    case DSP_BOR_EABX:
    case DSP_BXOR_EABX:
        result = command == DSP_BAND_EABX ? ebx & eax :
                 command == DSP_BOR_EABX ? ebx | eax : ebx ^ eax;
        stc32g_dsp_set_ebx(s, result);
        stc32g_dsp_set_z(s, result);
        break;
    case DSP_BAND_ABX:
    case DSP_BOR_ABX:
    case DSP_BXOR_ABX:
        result = command == DSP_BAND_ABX ?
                 (uint16_t)ebx & (uint16_t)eax :
                 command == DSP_BOR_ABX ?
                 (uint16_t)ebx | (uint16_t)eax :
                 (uint16_t)ebx ^ (uint16_t)eax;
        stc32g_dsp_set_bx(s, result);
        stc32g_dsp_set_z(s, result);
        break;
    case DSP_BCPL_EAX:
        result = ~eax;
        stc32g_dsp_set_eax(s, result);
        stc32g_dsp_set_z(s, result);
        break;
    case DSP_BCPL_EBX:
        result = ~ebx;
        stc32g_dsp_set_ebx(s, result);
        stc32g_dsp_set_z(s, result);
        break;
    case DSP_SHL_EAX:
    case DSP_SHRU_EAX:
    case DSP_SHRS_EAX:
    case DSP_ROR_EAX:
        count = mcs251_cpu_get_reg8(env, MCS251_REG_ACC) & 31;
        if (command == DSP_SHL_EAX) {
            result = stc32g_dsp_shift_left(s, eax, count, 32);
        } else if (command == DSP_SHRU_EAX) {
            result = stc32g_dsp_shift_right(s, eax, count, 32, false);
        } else if (command == DSP_SHRS_EAX) {
            result = stc32g_dsp_shift_right(s, eax, count, 32, true);
        } else {
            result = ror32(eax, count);
        }
        stc32g_dsp_set_eax(s, result);
        break;
    case DSP_SHL_EBX:
    case DSP_SHRU_EBX:
    case DSP_SHRS_EBX:
    case DSP_ROR_EBX:
        count = mcs251_cpu_get_reg8(env, MCS251_REG_ACC) & 31;
        if (command == DSP_SHL_EBX) {
            result = stc32g_dsp_shift_left(s, ebx, count, 32);
        } else if (command == DSP_SHRU_EBX) {
            result = stc32g_dsp_shift_right(s, ebx, count, 32, false);
        } else if (command == DSP_SHRS_EBX) {
            result = stc32g_dsp_shift_right(s, ebx, count, 32, true);
        } else {
            result = ror32(ebx, count);
        }
        stc32g_dsp_set_ebx(s, result);
        break;
    case DSP_SHL_AX:
    case DSP_SHRU_AX:
    case DSP_SHRS_AX:
    case DSP_ROR_AX:
        count = mcs251_cpu_get_reg8(env, MCS251_REG_ACC) & 15;
        if (command == DSP_SHL_AX) {
            result = stc32g_dsp_shift_left(s, eax, count, 16);
        } else if (command == DSP_SHRU_AX) {
            result = stc32g_dsp_shift_right(s, (uint16_t)eax,
                                            count, 16, false);
        } else if (command == DSP_SHRS_AX) {
            result = stc32g_dsp_shift_right(s, (uint16_t)eax,
                                            count, 16, true);
        } else {
            result = ror16(eax, count);
        }
        stc32g_dsp_set_ax(s, result);
        break;
    case DSP_SHL_BX:
    case DSP_SHRU_BX:
    case DSP_SHRS_BX:
    case DSP_ROR_BX:
        count = mcs251_cpu_get_reg8(env, MCS251_REG_ACC) & 15;
        if (command == DSP_SHL_BX) {
            result = stc32g_dsp_shift_left(s, ebx, count, 16);
        } else if (command == DSP_SHRU_BX) {
            result = stc32g_dsp_shift_right(s, (uint16_t)ebx,
                                            count, 16, false);
        } else if (command == DSP_SHRS_BX) {
            result = stc32g_dsp_shift_right(s, (uint16_t)ebx,
                                            count, 16, true);
        } else {
            result = ror16(ebx, count);
        }
        stc32g_dsp_set_bx(s, result);
        break;
    case DSP_MMD32_EABX:
        if (stc32g_dsp_get_cd(s, false, &edx) &&
            stc32g_dsp_get_cd(s, true, &ecx) &&
            stc32g_dsp_divisor_ok(s, edx)) {
            int64_t quotient =
                ((int64_t)(int32_t)eax * (int32_t)ebx) / (int32_t)edx;

            stc32g_dsp_set_eax(s, quotient);
            stc32g_dsp_set_cd(s, true, (uint64_t)quotient >> 32);
        }
        break;
    case DSP_MMD16_ABX:
        if (stc32g_dsp_get_cd(s, false, &edx) &&
            stc32g_dsp_divisor_ok(s, (uint16_t)edx)) {
            int32_t quotient =
                ((int32_t)(int16_t)eax * (int16_t)ebx) / (int16_t)edx;

            stc32g_dsp_set_eax(s, quotient);
        }
        break;
    case DSP_LTC32_EAX:
        if (stc32g_dsp_get_cd(s, false, &edx) &&
            stc32g_dsp_get_cd(s, true, &ecx)) {
            int64_t difference = (int64_t)(int32_t)eax - (int32_t)ebx;

            stc32g_dsp_sub(s, eax, ebx, 0, 32, false);
            if (stc32g_dsp_divisor_ok(s, edx)) {
                int64_t quotient =
                    difference * (int32_t)ecx / (int32_t)edx;

                stc32g_dsp_set_eax(s, quotient);
                stc32g_dsp_set_cd(s, true,
                                  (uint64_t)quotient >> 32);
            }
        }
        break;
    case DSP_LTC16_AX:
        if (stc32g_dsp_get_cd(s, false, &edx) &&
            stc32g_dsp_get_cd(s, true, &ecx)) {
            int32_t difference = (int16_t)eax - (int16_t)ebx;

            stc32g_dsp_sub(s, eax, ebx, 0, 16, false);
            if (stc32g_dsp_divisor_ok(s, (uint16_t)edx)) {
                int64_t quotient =
                    (int64_t)difference * (int16_t)ecx / (int16_t)edx;

                stc32g_dsp_set_eax(s, quotient);
            }
        }
        break;
    case DSP_MA32_EDX:
        if (stc32g_dsp_get_cd(s, false, &edx)) {
            result = (int32_t)(int16_t)eax * (int16_t)ebx;
            stc32g_dsp_set_cd(
                s, false, stc32g_dsp_add(s, edx, result, 0, 32, false));
        }
        break;
    case DSP_MA64_ECDX:
        if (stc32g_dsp_get_cd(s, false, &edx) &&
            stc32g_dsp_get_cd(s, true, &ecx)) {
            uint64_t accumulator = ((uint64_t)ecx << 32) | edx;
            uint64_t product = (int64_t)(int32_t)eax * (int32_t)ebx;
            uint64_t sum = accumulator + product;
            uint64_t sign = BIT_ULL(63);

            env->flag_c = sum < accumulator;
            env->flag_ov =
                (~(accumulator ^ product) &
                 (accumulator ^ sum) & sign) != 0;
            stc32g_dsp_set_cd(s, true, sum >> 32);
            stc32g_dsp_set_cd(s, false, sum);
        }
        break;
    default:
        break;
    }
}

static void stc32g_dsp_command_post_write(RegisterInfo *reg, uint64_t value)
{
    Stc32gDSPState *s = STC32G_DSP(reg->opaque);

    if (!device_is_in_reset(DEVICE(s))) {
        stc32g_dsp_execute(s, value);
    }
}

static const RegisterAccessInfo stc32g_dsp_status_regs_info[] = {
    { .name = "DPUST", .addr = A_DPUST, .ro = UINT8_MAX },
};

static const RegisterAccessInfo stc32g_dsp_command_regs_info[] = {
    { .name = "DPUOP", .addr = A_DPUOP,
      .post_write = stc32g_dsp_command_post_write },
};

static const MemoryRegionOps stc32g_dsp_regs_ops = {
    .read = register_read_memory,
    .write = register_write_memory,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 1,
    .valid.max_access_size = 1,
};

