zevorn/qemu/hw/mcs51/stc32g_dsp.c
static void stc32g_dsp_reset(DeviceState *dev)
{
    Stc32gDSPState *s = STC32G_DSP(dev);

    register_reset(&s->status_reg_info[R_DPUST]);
    register_reset(&s->command_reg_info[R_DPUOP]);
    s->dpucfg = 5;
}

static const VMStateDescription stc32g_dsp_vmstate = {
    .name = "stc32g.dsp32",
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT8_ARRAY(status_regs, Stc32gDSPState, 1),
        VMSTATE_UINT8_ARRAY(command_regs, Stc32gDSPState, 1),
        VMSTATE_UINT8(dpucfg, Stc32gDSPState),
        VMSTATE_END_OF_LIST()
    },
};

static const Property stc32g_dsp_properties[] = {
    DEFINE_PROP_LINK("cpu", Stc32gDSPState, cpu, TYPE_MCS251_CPU,
                     MCS251CPU *),
};

static void stc32g_dsp_realize(DeviceState *dev, Error **errp)
{
    Stc32gDSPState *s = STC32G_DSP(dev);

    if (!s->cpu) {
        error_setg(errp, "stc32g-dsp32 requires a CPU link");
    }
}

static void stc32g_dsp_init(Object *obj)
{
    Stc32gDSPState *s = STC32G_DSP(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    s->status_reg_array = register_init_block8(
        DEVICE(obj), stc32g_dsp_status_regs_info,
        ARRAY_SIZE(stc32g_dsp_status_regs_info), s->status_reg_info,
        s->status_regs, &stc32g_dsp_regs_ops, false, 1);
    s->command_reg_array = register_init_block8(
        DEVICE(obj), stc32g_dsp_command_regs_info,
        ARRAY_SIZE(stc32g_dsp_command_regs_info), s->command_reg_info,
        s->command_regs, &stc32g_dsp_regs_ops, false, 1);
    sysbus_init_mmio(sbd, &s->status_reg_array->mem);
    sysbus_init_mmio(sbd, &s->command_reg_array->mem);
}

static void stc32g_dsp_class_init(ObjectClass *oc, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(oc);

    dc->realize = stc32g_dsp_realize;
    device_class_set_legacy_reset(dc, stc32g_dsp_reset);
    device_class_set_props(dc, stc32g_dsp_properties);
    dc->vmsd = &stc32g_dsp_vmstate;
}

static const TypeInfo stc32g_dsp_type = {
    .name = TYPE_STC32G_DSP,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(Stc32gDSPState),
    .instance_init = stc32g_dsp_init,
    .class_init = stc32g_dsp_class_init,
};

static void stc32g_dsp_register_types(void)
{
    type_register_static(&stc32g_dsp_type);
}

type_init(stc32g_dsp_register_types)
